## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 4 to add, 0 to change, 2 to destroy.</code></pre>

* Create
  * google_container_node_pool.components_pool
  * google_container_node_pool.prowjobs_pool
  * module.trusted_workload_gatekeeper.kubectl_manifest.constraints["# Constraint to allow only image-builder tool trusted usage on tekton cluster run as image-builder service account identity.\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: SecretTrustedUsage\nmetadata:\n  name: kyma-bot-github-token\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  parameters:\n    restrictedSecrets:\n      # usually provided with preset-bot-github-token\n      - kyma-bot-github-token\n    trustedImages:\n      # rel-api-gateway-goreleaser\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/bash\",\"-c\",\"hack\\/release\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # rel-kyma-cli\n      - image: \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"make\",\"ci-release\"\\],\"container_name\":\"test\",.*$'\n      # pre-main-control-plane-reconciler-upgrade-kyma2-latest-to-main-gardener\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/reconciler-upgrade-kyma2-latest-to-main-gardener\\.sh\",\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-incubator\\/reconciler\"\\],\"container_name\":\"test\",.*$'\n      # reconciler-control-plane-image-bump\n      - image: \"gcr.io/k8s-prow/generic-autobumper:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"generic-autobumper\",\"--config=\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/autobump-config\\/control-plane-autobump-reconciler-config\\.yaml\"\\],\"container_name\":\"test\",.*$'\n      # nightly-main-reconciler\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/reconciler-gardener-long-lasting\\.sh\",\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-incubator\\/reconciler\"\\],\"container_name\":\"test\",.*$'\n      # nightly-main-reconciler-e2e\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/reconciler-e2e-nightly-gardener\\.sh\",\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-incubator\\/reconciler\"\\],\"container_name\":\"test\",.*$'\n      # *-kyma-artifacts, *-rel*-kyma-artifacts\n      - image: \"eu.gcr.io/kyma-project/test-infra/bootstrap:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/build-kyma-artifacts\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # pre-main-kyma-gardener-gcp-eventing-upgrade\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/kyma-integration-gardener-eventing-upgrade\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # kyma-upgrade-gardener-kyma2-to-main-reconciler-main\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/kyma-upgrade-gardener-kyma2-to-main\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # kyma-upgrade-gardener-kyma2-minor-versions\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/kyma-upgrade-gardener-kyma2-minor-versions\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # github-issues\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/github-issues\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # pre-release-pr-image-guard\n      - image: \"eu.gcr.io/kyma-project/test-infra/bootstrap:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/pr-image-guard\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # skr-aws-upgrade-integration-dev\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/skr-aws-upgrade-integration-dev\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # post-keda-manager-module-build\n      - image: \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\.\\/scripts\\/release.sh\",\"ci\"\\],\"container_name\":\"test\",.*$'\n      # post-telemetry-manager-release-module\n      - image: \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"make\",\"release\"\\],\"container_name\":\"test\",.*$'\n      # ci-prow-branchprotector\n      - image: \"gcr.io/k8s-prow/branchprotector:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"branchprotector\",\"--config-path=prow\\/config\\.yaml\",\"--job-config-path=prow\\/jobs\",\"--github-token-path=\\/etc\\/github\\/token\",\"--confirm\",\"--github-endpoint=http:\\/\\/ghproxy\",\"--github-endpoint=https:\\/\\/api\\.github\\.com\"\\],\"container_name\":\"test\",.*$'\n      # pull-hide-tf-github-comments\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/ghcomment\\/github-comment\",\"hide\",\"--org\",\"\\$(REPO_OWNER)\",\"--repo\",\"\\$(REPO_NAME)\",\"-pr\",\"\\$(PULL_NUMBER)\",\"-sha1\",\"\\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # pre-main-check-users-map\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"usersmapchecker\"\\],\"container_name\":\"test\",.*$'\n      # pull-secret-leaks-log-scanner-tf-plan\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER -sha \\$PULL_PULL_SHA\\nplan -- terraform -chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner plan\\n-input=false; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # post-secret-leaks-log-scanner-tf-apply\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_BASE_SHA apply\\n-- terraform -chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner apply -input=false\\n-auto-approve; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # pull-secrets-rotator-tf-plan\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/development\\/secrets-rotator\\/terraform\\/environments\\/prod init -input=false\\n\\\\u0026\\\\u0026 \\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER\\n-sha \\$PULL_PULL_SHA plan -- terraform -chdir=\\.\\/development\\/secrets-rotator\\/terraform\\/environments\\/prod\\nplan -input=false -var-file=\\.\\/terraform\\.tfvars; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # jobname\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_BASE_SHA apply\\n-- terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod apply -input=false\\n-auto-approve  -var-file=\\.\\/terraform\\.tfvars; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # pull-plan-prod-terraform\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER -sha \\$PULL_PULL_SHA\\nplan -- terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod plan -input=false\\n-no-color; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # post-apply-prod-terraform\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_BASE_SHA apply\\n-- terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod apply -input=false\\n-no-color -auto-approve; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # sidecar\n      - image: \"gcr.io/k8s-prow/sidecar:*\"\n        command: []\n        args: []"]
  * module.untrusted_workload_gatekeeper.kubectl_manifest.constraints["# Constraint to allow only image-builder tool trusted usage on tekton cluster run as image-builder service account identity.\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: SecretTrustedUsage\nmetadata:\n  name: kyma-bot-github-token\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  parameters:\n    restrictedSecrets:\n      # usually provided with preset-bot-github-token\n      - kyma-bot-github-token\n    trustedImages:\n      # rel-api-gateway-goreleaser\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/bash\",\"-c\",\"hack\\/release\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # rel-kyma-cli\n      - image: \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"make\",\"ci-release\"\\],\"container_name\":\"test\",.*$'\n      # pre-main-control-plane-reconciler-upgrade-kyma2-latest-to-main-gardener\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/reconciler-upgrade-kyma2-latest-to-main-gardener\\.sh\",\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-incubator\\/reconciler\"\\],\"container_name\":\"test\",.*$'\n      # reconciler-control-plane-image-bump\n      - image: \"gcr.io/k8s-prow/generic-autobumper:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"generic-autobumper\",\"--config=\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/autobump-config\\/control-plane-autobump-reconciler-config\\.yaml\"\\],\"container_name\":\"test\",.*$'\n      # nightly-main-reconciler\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/reconciler-gardener-long-lasting\\.sh\",\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-incubator\\/reconciler\"\\],\"container_name\":\"test\",.*$'\n      # nightly-main-reconciler-e2e\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/reconciler-e2e-nightly-gardener\\.sh\",\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-incubator\\/reconciler\"\\],\"container_name\":\"test\",.*$'\n      # *-kyma-artifacts, *-rel*-kyma-artifacts\n      - image: \"eu.gcr.io/kyma-project/test-infra/bootstrap:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/build-kyma-artifacts\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # pre-main-kyma-gardener-gcp-eventing-upgrade\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/kyma-integration-gardener-eventing-upgrade\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # kyma-upgrade-gardener-kyma2-to-main-reconciler-main\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/kyma-upgrade-gardener-kyma2-to-main\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # kyma-upgrade-gardener-kyma2-minor-versions\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/kyma-upgrade-gardener-kyma2-minor-versions\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # github-issues\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/github-issues\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # pre-release-pr-image-guard\n      - image: \"eu.gcr.io/kyma-project/test-infra/bootstrap:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/pr-image-guard\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # skr-aws-upgrade-integration-dev\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/skr-aws-upgrade-integration-dev\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # post-keda-manager-module-build\n      - image: \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\.\\/scripts\\/release.sh\",\"ci\"\\],\"container_name\":\"test\",.*$'\n      # post-telemetry-manager-release-module\n      - image: \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"make\",\"release\"\\],\"container_name\":\"test\",.*$'\n      # ci-prow-branchprotector\n      - image: \"gcr.io/k8s-prow/branchprotector:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"branchprotector\",\"--config-path=prow\\/config\\.yaml\",\"--job-config-path=prow\\/jobs\",\"--github-token-path=\\/etc\\/github\\/token\",\"--confirm\",\"--github-endpoint=http:\\/\\/ghproxy\",\"--github-endpoint=https:\\/\\/api\\.github\\.com\"\\],\"container_name\":\"test\",.*$'\n      # pull-hide-tf-github-comments\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/ghcomment\\/github-comment\",\"hide\",\"--org\",\"\\$(REPO_OWNER)\",\"--repo\",\"\\$(REPO_NAME)\",\"-pr\",\"\\$(PULL_NUMBER)\",\"-sha1\",\"\\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # pre-main-check-users-map\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"usersmapchecker\"\\],\"container_name\":\"test\",.*$'\n      # pull-secret-leaks-log-scanner-tf-plan\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER -sha \\$PULL_PULL_SHA\\nplan -- terraform -chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner plan\\n-input=false; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # post-secret-leaks-log-scanner-tf-apply\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_BASE_SHA apply\\n-- terraform -chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner apply -input=false\\n-auto-approve; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # pull-secrets-rotator-tf-plan\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/development\\/secrets-rotator\\/terraform\\/environments\\/prod init -input=false\\n\\\\u0026\\\\u0026 \\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER\\n-sha \\$PULL_PULL_SHA plan -- terraform -chdir=\\.\\/development\\/secrets-rotator\\/terraform\\/environments\\/prod\\nplan -input=false -var-file=\\.\\/terraform\\.tfvars; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # jobname\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_BASE_SHA apply\\n-- terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod apply -input=false\\n-auto-approve  -var-file=\\.\\/terraform\\.tfvars; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # pull-plan-prod-terraform\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER -sha \\$PULL_PULL_SHA\\nplan -- terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod plan -input=false\\n-no-color; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # post-apply-prod-terraform\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_BASE_SHA apply\\n-- terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod apply -input=false\\n-no-color -auto-approve; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # sidecar\n      - image: \"gcr.io/k8s-prow/sidecar:*\"\n        command: []\n        args: []"]
* Delete
  * module.trusted_workload_gatekeeper.kubectl_manifest.constraints["# Constraint to allow only image-builder tool trusted usage on tekton cluster run as image-builder service account identity.\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: SecretTrustedUsage\nmetadata:\n  name: kyma-bot-github-token\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  parameters:\n    restrictedSecrets:\n      # usually provided with preset-bot-github-token\n      - kyma-bot-github-token\n    trustedImages:\n      # rel-api-gateway-goreleaser\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/bash\",\"-c\",\"hack\\/release\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # rel-kyma-cli\n      - image: \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"make\",\"ci-release\"\\],\"container_name\":\"test\",.*$'\n      # unstable-cli\n      - image: \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/reconciler-publish-unstable-cli\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # pre-main-control-plane-reconciler-upgrade-kyma2-latest-to-main-gardener\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/reconciler-upgrade-kyma2-latest-to-main-gardener\\.sh\",\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-incubator\\/reconciler\"\\],\"container_name\":\"test\",.*$'\n      # reconciler-control-plane-image-bump\n      - image: \"gcr.io/k8s-prow/generic-autobumper:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"generic-autobumper\",\"--config=\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/autobump-config\\/control-plane-autobump-reconciler-config\\.yaml\"\\],\"container_name\":\"test\",.*$'\n      # nightly-main-reconciler\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/reconciler-gardener-long-lasting\\.sh\",\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-incubator\\/reconciler\"\\],\"container_name\":\"test\",.*$'\n      # nightly-main-reconciler-e2e\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/reconciler-e2e-nightly-gardener\\.sh\",\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-incubator\\/reconciler\"\\],\"container_name\":\"test\",.*$'\n      # *-kyma-artifacts, *-rel*-kyma-artifacts\n      - image: \"eu.gcr.io/kyma-project/test-infra/bootstrap:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/build-kyma-artifacts\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # pre-main-kyma-gardener-gcp-eventing-upgrade\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/kyma-integration-gardener-eventing-upgrade\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # kyma-upgrade-gardener-kyma2-to-main-reconciler-main\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/kyma-upgrade-gardener-kyma2-to-main\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # kyma-upgrade-gardener-kyma2-minor-versions\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/kyma-upgrade-gardener-kyma2-minor-versions\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # github-issues\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/github-issues\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # pre-release-pr-image-guard\n      - image: \"eu.gcr.io/kyma-project/test-infra/bootstrap:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/pr-image-guard\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # skr-aws-upgrade-integration-dev\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/skr-aws-upgrade-integration-dev\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # post-keda-manager-module-build\n      - image: \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\.\\/scripts\\/release.sh\",\"ci\"\\],\"container_name\":\"test\",.*$'\n      # post-telemetry-manager-release-module\n      - image: \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"make\",\"release\"\\],\"container_name\":\"test\",.*$'\n      # ci-prow-branchprotector\n      - image: \"gcr.io/k8s-prow/branchprotector:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"branchprotector\",\"--config-path=prow\\/config\\.yaml\",\"--job-config-path=prow\\/jobs\",\"--github-token-path=\\/etc\\/github\\/token\",\"--confirm\",\"--github-endpoint=http:\\/\\/ghproxy\",\"--github-endpoint=https:\\/\\/api\\.github\\.com\"\\],\"container_name\":\"test\",.*$'\n      # pull-hide-tf-github-comments\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/ghcomment\\/github-comment\",\"hide\",\"--org\",\"\\$(REPO_OWNER)\",\"--repo\",\"\\$(REPO_NAME)\",\"-pr\",\"\\$(PULL_NUMBER)\",\"-sha1\",\"\\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # pre-main-check-users-map\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"usersmapchecker\"\\],\"container_name\":\"test\",.*$'\n      # pull-secret-leaks-log-scanner-tf-plan\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER -sha \\$PULL_PULL_SHA\\nplan -- terraform -chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner plan\\n-input=false; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # post-secret-leaks-log-scanner-tf-apply\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_BASE_SHA apply\\n-- terraform -chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner apply -input=false\\n-auto-approve; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # pull-secrets-rotator-tf-plan\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/development\\/secrets-rotator\\/terraform\\/environments\\/prod init -input=false\\n\\\\u0026\\\\u0026 \\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER\\n-sha \\$PULL_PULL_SHA plan -- terraform -chdir=\\.\\/development\\/secrets-rotator\\/terraform\\/environments\\/prod\\nplan -input=false -var-file=\\.\\/terraform\\.tfvars; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # jobname\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_BASE_SHA apply\\n-- terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod apply -input=false\\n-auto-approve  -var-file=\\.\\/terraform\\.tfvars; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # pull-plan-prod-terraform\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER -sha \\$PULL_PULL_SHA\\nplan -- terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod plan -input=false\\n-no-color; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # post-apply-prod-terraform\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_BASE_SHA apply\\n-- terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod apply -input=false\\n-no-color -auto-approve; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # sidecar\n      - image: \"gcr.io/k8s-prow/sidecar:*\"\n        command: []\n        args: []"]
  * module.untrusted_workload_gatekeeper.kubectl_manifest.constraints["# Constraint to allow only image-builder tool trusted usage on tekton cluster run as image-builder service account identity.\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: SecretTrustedUsage\nmetadata:\n  name: kyma-bot-github-token\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  parameters:\n    restrictedSecrets:\n      # usually provided with preset-bot-github-token\n      - kyma-bot-github-token\n    trustedImages:\n      # rel-api-gateway-goreleaser\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/bash\",\"-c\",\"hack\\/release\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # rel-kyma-cli\n      - image: \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"make\",\"ci-release\"\\],\"container_name\":\"test\",.*$'\n      # unstable-cli\n      - image: \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/reconciler-publish-unstable-cli\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # pre-main-control-plane-reconciler-upgrade-kyma2-latest-to-main-gardener\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/reconciler-upgrade-kyma2-latest-to-main-gardener\\.sh\",\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-incubator\\/reconciler\"\\],\"container_name\":\"test\",.*$'\n      # reconciler-control-plane-image-bump\n      - image: \"gcr.io/k8s-prow/generic-autobumper:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"generic-autobumper\",\"--config=\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/autobump-config\\/control-plane-autobump-reconciler-config\\.yaml\"\\],\"container_name\":\"test\",.*$'\n      # nightly-main-reconciler\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/reconciler-gardener-long-lasting\\.sh\",\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-incubator\\/reconciler\"\\],\"container_name\":\"test\",.*$'\n      # nightly-main-reconciler-e2e\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/reconciler-e2e-nightly-gardener\\.sh\",\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-incubator\\/reconciler\"\\],\"container_name\":\"test\",.*$'\n      # *-kyma-artifacts, *-rel*-kyma-artifacts\n      - image: \"eu.gcr.io/kyma-project/test-infra/bootstrap:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/build-kyma-artifacts\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # pre-main-kyma-gardener-gcp-eventing-upgrade\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/kyma-integration-gardener-eventing-upgrade\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # kyma-upgrade-gardener-kyma2-to-main-reconciler-main\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/kyma-upgrade-gardener-kyma2-to-main\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # kyma-upgrade-gardener-kyma2-minor-versions\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/kyma-upgrade-gardener-kyma2-minor-versions\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # github-issues\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/github-issues\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # pre-release-pr-image-guard\n      - image: \"eu.gcr.io/kyma-project/test-infra/bootstrap:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/pr-image-guard\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # skr-aws-upgrade-integration-dev\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/skr-aws-upgrade-integration-dev\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # post-keda-manager-module-build\n      - image: \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\.\\/scripts\\/release.sh\",\"ci\"\\],\"container_name\":\"test\",.*$'\n      # post-telemetry-manager-release-module\n      - image: \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"make\",\"release\"\\],\"container_name\":\"test\",.*$'\n      # ci-prow-branchprotector\n      - image: \"gcr.io/k8s-prow/branchprotector:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"branchprotector\",\"--config-path=prow\\/config\\.yaml\",\"--job-config-path=prow\\/jobs\",\"--github-token-path=\\/etc\\/github\\/token\",\"--confirm\",\"--github-endpoint=http:\\/\\/ghproxy\",\"--github-endpoint=https:\\/\\/api\\.github\\.com\"\\],\"container_name\":\"test\",.*$'\n      # pull-hide-tf-github-comments\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/ghcomment\\/github-comment\",\"hide\",\"--org\",\"\\$(REPO_OWNER)\",\"--repo\",\"\\$(REPO_NAME)\",\"-pr\",\"\\$(PULL_NUMBER)\",\"-sha1\",\"\\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # pre-main-check-users-map\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"usersmapchecker\"\\],\"container_name\":\"test\",.*$'\n      # pull-secret-leaks-log-scanner-tf-plan\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER -sha \\$PULL_PULL_SHA\\nplan -- terraform -chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner plan\\n-input=false; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # post-secret-leaks-log-scanner-tf-apply\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_BASE_SHA apply\\n-- terraform -chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner apply -input=false\\n-auto-approve; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # pull-secrets-rotator-tf-plan\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/development\\/secrets-rotator\\/terraform\\/environments\\/prod init -input=false\\n\\\\u0026\\\\u0026 \\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER\\n-sha \\$PULL_PULL_SHA plan -- terraform -chdir=\\.\\/development\\/secrets-rotator\\/terraform\\/environments\\/prod\\nplan -input=false -var-file=\\.\\/terraform\\.tfvars; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # jobname\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_BASE_SHA apply\\n-- terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod apply -input=false\\n-auto-approve  -var-file=\\.\\/terraform\\.tfvars; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # pull-plan-prod-terraform\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER -sha \\$PULL_PULL_SHA\\nplan -- terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod plan -input=false\\n-no-color; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # post-apply-prod-terraform\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_BASE_SHA apply\\n-- terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod apply -input=false\\n-no-color -auto-approve; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # sidecar\n      - image: \"gcr.io/k8s-prow/sidecar:*\"\n        command: []\n        args: []"]



<details><summary>Change Result (Click me)</summary>

```hcl

  # google_container_node_pool.components_pool will be created
  + resource "google_container_node_pool" "components_pool" {
      + cluster                     = "projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = (known after apply)
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "components-pool"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = (known after apply)
      + version                     = (known after apply)

      + autoscaling {
          + location_policy = "ANY"
          + max_node_count  = 2
          + min_node_count  = 1
        }

      + management {
          + auto_repair  = (known after apply)
          + auto_upgrade = (known after apply)
        }

      + network_config {
          + create_pod_range     = (known after apply)
          + enable_private_nodes = (known after apply)
          + pod_ipv4_cidr_block  = (known after apply)
          + pod_range            = (known after apply)

          + pod_cidr_overprovision_config {
              + disabled = (known after apply)
            }
        }

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = {
              + "workload" = "components"
            }
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = "e2-medium"
          + metadata          = {
              + "disable-legacy-endpoints" = "true"
            }
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = true
          + service_account   = (known after apply)
          + spot              = false
          + taint             = [
              + {
                  + effect = "NO_SCHEDULE"
                  + key    = "components.gke.io/gke-managed-components"
                  + value  = ""
                },
            ]

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }

      + upgrade_settings {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
          + strategy        = (known after apply)

          + blue_green_settings {
              + node_pool_soak_duration = (known after apply)

              + standard_rollout_policy {
                  + batch_node_count    = (known after apply)
                  + batch_percentage    = (known after apply)
                  + batch_soak_duration = (known after apply)
                }
            }
        }
    }

  # google_container_node_pool.prowjobs_pool will be created
  + resource "google_container_node_pool" "prowjobs_pool" {
      + cluster                     = "projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = (known after apply)
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "prowjobs-pool"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = (known after apply)
      + version                     = (known after apply)

      + autoscaling {
          + location_policy = "ANY"
          + max_node_count  = 16
          + min_node_count  = 0
        }

      + management {
          + auto_repair  = (known after apply)
          + auto_upgrade = (known after apply)
        }

      + network_config {
          + create_pod_range     = (known after apply)
          + enable_private_nodes = (known after apply)
          + pod_ipv4_cidr_block  = (known after apply)
          + pod_range            = (known after apply)

          + pod_cidr_overprovision_config {
              + disabled = (known after apply)
            }
        }

      + node_config {
          + disk_size_gb      = 200
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = {
              + "workload" = "prowjobs"
            }
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = "n2d-standard-8"
          + metadata          = {
              + "disable-legacy-endpoints" = "true"
            }
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = true
          + service_account   = (known after apply)
          + spot              = false
          + taint             = (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }

      + upgrade_settings {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
          + strategy        = (known after apply)

          + blue_green_settings {
              + node_pool_soak_duration = (known after apply)

              + standard_rollout_policy {
                  + batch_node_count    = (known after apply)
                  + batch_percentage    = (known after apply)
                  + batch_soak_duration = (known after apply)
                }
            }
        }
    }

  # module.trusted_workload_gatekeeper.kubectl_manifest.constraints["# Constraint to allow only image-builder tool trusted usage on tekton cluster run as image-builder service account identity.\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: SecretTrustedUsage\nmetadata:\n  name: kyma-bot-github-token\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  parameters:\n    restrictedSecrets:\n      # usually provided with preset-bot-github-token\n      - kyma-bot-github-token\n    trustedImages:\n      # rel-api-gateway-goreleaser\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/bash\",\"-c\",\"hack\\/release\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # rel-kyma-cli\n      - image: \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"make\",\"ci-release\"\\],\"container_name\":\"test\",.*$'\n      # pre-main-control-plane-reconciler-upgrade-kyma2-latest-to-main-gardener\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/reconciler-upgrade-kyma2-latest-to-main-gardener\\.sh\",\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-incubator\\/reconciler\"\\],\"container_name\":\"test\",.*$'\n      # reconciler-control-plane-image-bump\n      - image: \"gcr.io/k8s-prow/generic-autobumper:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"generic-autobumper\",\"--config=\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/autobump-config\\/control-plane-autobump-reconciler-config\\.yaml\"\\],\"container_name\":\"test\",.*$'\n      # nightly-main-reconciler\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/reconciler-gardener-long-lasting\\.sh\",\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-incubator\\/reconciler\"\\],\"container_name\":\"test\",.*$'\n      # nightly-main-reconciler-e2e\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/reconciler-e2e-nightly-gardener\\.sh\",\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-incubator\\/reconciler\"\\],\"container_name\":\"test\",.*$'\n      # *-kyma-artifacts, *-rel*-kyma-artifacts\n      - image: \"eu.gcr.io/kyma-project/test-infra/bootstrap:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/build-kyma-artifacts\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # pre-main-kyma-gardener-gcp-eventing-upgrade\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/kyma-integration-gardener-eventing-upgrade\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # kyma-upgrade-gardener-kyma2-to-main-reconciler-main\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/kyma-upgrade-gardener-kyma2-to-main\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # kyma-upgrade-gardener-kyma2-minor-versions\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/kyma-upgrade-gardener-kyma2-minor-versions\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # github-issues\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/github-issues\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # pre-release-pr-image-guard\n      - image: \"eu.gcr.io/kyma-project/test-infra/bootstrap:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/pr-image-guard\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # skr-aws-upgrade-integration-dev\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/skr-aws-upgrade-integration-dev\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # post-keda-manager-module-build\n      - image: \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\.\\/scripts\\/release.sh\",\"ci\"\\],\"container_name\":\"test\",.*$'\n      # post-telemetry-manager-release-module\n      - image: \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"make\",\"release\"\\],\"container_name\":\"test\",.*$'\n      # ci-prow-branchprotector\n      - image: \"gcr.io/k8s-prow/branchprotector:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"branchprotector\",\"--config-path=prow\\/config\\.yaml\",\"--job-config-path=prow\\/jobs\",\"--github-token-path=\\/etc\\/github\\/token\",\"--confirm\",\"--github-endpoint=http:\\/\\/ghproxy\",\"--github-endpoint=https:\\/\\/api\\.github\\.com\"\\],\"container_name\":\"test\",.*$'\n      # pull-hide-tf-github-comments\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/ghcomment\\/github-comment\",\"hide\",\"--org\",\"\\$(REPO_OWNER)\",\"--repo\",\"\\$(REPO_NAME)\",\"-pr\",\"\\$(PULL_NUMBER)\",\"-sha1\",\"\\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # pre-main-check-users-map\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"usersmapchecker\"\\],\"container_name\":\"test\",.*$'\n      # pull-secret-leaks-log-scanner-tf-plan\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER -sha \\$PULL_PULL_SHA\\nplan -- terraform -chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner plan\\n-input=false; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # post-secret-leaks-log-scanner-tf-apply\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_BASE_SHA apply\\n-- terraform -chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner apply -input=false\\n-auto-approve; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # pull-secrets-rotator-tf-plan\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/development\\/secrets-rotator\\/terraform\\/environments\\/prod init -input=false\\n\\\\u0026\\\\u0026 \\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER\\n-sha \\$PULL_PULL_SHA plan -- terraform -chdir=\\.\\/development\\/secrets-rotator\\/terraform\\/environments\\/prod\\nplan -input=false -var-file=\\.\\/terraform\\.tfvars; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # jobname\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_BASE_SHA apply\\n-- terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod apply -input=false\\n-auto-approve  -var-file=\\.\\/terraform\\.tfvars; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # pull-plan-prod-terraform\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER -sha \\$PULL_PULL_SHA\\nplan -- terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod plan -input=false\\n-no-color; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # post-apply-prod-terraform\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_BASE_SHA apply\\n-- terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod apply -input=false\\n-no-color -auto-approve; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # sidecar\n      - image: \"gcr.io/k8s-prow/sidecar:*\"\n        command: []\n        args: []"] will be created
  + resource "kubectl_manifest" "constraints" {
      + api_version             = "constraints.gatekeeper.sh/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "SecretTrustedUsage"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kyma-bot-github-token"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: 

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

cripts\\/cluster-integration\\/skr-aws-upgrade-integration-dev\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # post-keda-manager-module-build\n      - image: \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\.\\/scripts\\/release.sh\",\"ci\"\\],\"container_name\":\"test\",.*$'\n      # post-telemetry-manager-release-module\n      - image: \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"make\",\"release\"\\],\"container_name\":\"test\",.*$'\n      # ci-prow-branchprotector\n      - image: \"gcr.io/k8s-prow/branchprotector:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"branchprotector\",\"--config-path=prow\\/config\\.yaml\",\"--job-config-path=prow\\/jobs\",\"--github-token-path=\\/etc\\/github\\/token\",\"--confirm\",\"--github-endpoint=http:\\/\\/ghproxy\",\"--github-endpoint=https:\\/\\/api\\.github\\.com\"\\],\"container_name\":\"test\",.*$'\n      # pull-hide-tf-github-comments\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/ghcomment\\/github-comment\",\"hide\",\"--org\",\"\\$(REPO_OWNER)\",\"--repo\",\"\\$(REPO_NAME)\",\"-pr\",\"\\$(PULL_NUMBER)\",\"-sha1\",\"\\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # pre-main-check-users-map\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"usersmapchecker\"\\],\"container_name\":\"test\",.*$'\n      # pull-secret-leaks-log-scanner-tf-plan\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER -sha \\$PULL_PULL_SHA\\nplan -- terraform -chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner plan\\n-input=false; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # post-secret-leaks-log-scanner-tf-apply\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_BASE_SHA apply\\n-- terraform -chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner apply -input=false\\n-auto-approve; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # pull-secrets-rotator-tf-plan\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/development\\/secrets-rotator\\/terraform\\/environments\\/prod init -input=false\\n\\\\u0026\\\\u0026 \\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER\\n-sha \\$PULL_PULL_SHA plan -- terraform -chdir=\\.\\/development\\/secrets-rotator\\/terraform\\/environments\\/prod\\nplan -input=false -var-file=\\.\\/terraform\\.tfvars; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # jobname\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_BASE_SHA apply\\n-- terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod apply -input=false\\n-auto-approve  -var-file=\\.\\/terraform\\.tfvars; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # pull-plan-prod-terraform\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER -sha \\$PULL_PULL_SHA\\nplan -- terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod plan -input=false\\n-no-color; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # post-apply-prod-terraform\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_BASE_SHA apply\\n-- terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod apply -input=false\\n-no-color -auto-approve; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # sidecar\n      - image: \"gcr.io/k8s-prow/sidecar:*\"\n        command: []\n        args: []"] is not in for_each map)
  - resource "kubectl_manifest" "constraints" {
      - api_version             = "constraints.gatekeeper.sh/v1beta1" -> null
      - apply_only              = false -> null
      - force_conflicts         = false -> null
      - force_new               = false -> null
      - id                      = "/apis/constraints.gatekeeper.sh/v1beta1/secrettrustedusages/kyma-bot-github-token" -> null
      - kind                    = "SecretTrustedUsage" -> null
      - live_manifest_incluster = (sensitive value)
      - live_uid                = "ac236091-66da-42a6-a006-beed978886c9" -> null
      - name                    = "kyma-bot-github-token" -> null
      - server_side_apply       = false -> null
      - uid                     = "ac236091-66da-42a6-a006-beed978886c9" -> null
      - validate_schema         = true -> null
      - wait_for_rollout        = true -> null
      - yaml_body               = (sensitive value)
      - yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: SecretTrustedUsage
            metadata:
              name: kyma-bot-github-token
            spec:
              enforcementAction: warn
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
                namespaces:
                - default
              parameters:
                restrictedSecrets:
                - kyma-bot-github-token
                trustedImages:
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^.*"args":\["\/bin\/bash","-c","hack\/release\.sh"\],"container_name":"test",.*$
                  image: eu.gcr.io/kyma-project/test-infra/kyma-integration:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^.*"args":\["make","ci-release"\],"container_name":"test",.*$
                  image: eu.gcr.io/kyma-project/test-infra/buildpack-golang:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^.*"args":\["\/home\/prow\/go\/src\/github\.com\/kyma-project\/test-infra\/prow\/scripts\/reconciler-publish-unstable-cli\.sh"\],"container_name":"test",.*$
                  image: eu.gcr.io/kyma-project/test-infra/buildpack-golang:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^.*"args":\["\/home\/prow\/go\/src\/github\.com\/kyma-project\/test-infra\/prow\/scripts\/cluster-integration\/reconciler-upgrade-kyma2-latest-to-main-gardener\.sh","\/home\/prow\/go\/src\/github\.com\/kyma-incubator\/reconciler"\],"container_name":"test",.*$
                  image: eu.gcr.io/kyma-project/test-infra/kyma-integration:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^.*"args":\["generic-autobumper","--config=\/home\/prow\/go\/src\/github\.com\/kyma-project\/test-infra\/prow\/autobump-config\/control-plane-autobump-reconciler-config\.yaml"\],"container_name":"test",.*$
                  image: gcr.io/k8s-prow/generic-autobumper:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^.*"args":\["\/home\/prow\/go\/src\/github\.com\/kyma-project\/test-infra\/prow\/scripts\/cluster-integration\/reconciler-gardener-long-lasting\.sh","\/home\/prow\/go\/src\/github\.com\/kyma-incubator\/reconciler"\],"container_name":"test",.*$
                  image: eu.gcr.io/kyma-project/test-infra/kyma-integration:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^.*"args":\["\/home\/prow\/go\/src\/github\.com\/kyma-project\/test-infra\/prow\/scripts\/cluster-integration\/reconciler-e2e-nightly-gardener\.sh","\/home\/prow\/go\/src\/github\.com\/kyma-incubator\/reconciler"\],"container_name":"test",.*$
                  image: eu.gcr.io/kyma-project/test-infra/kyma-integration:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^.*"args":\["\/home\/prow\/go\/src\/github\.com\/kyma-project\/test-infra\/prow\/scripts\/build-kyma-artifacts\.sh"\],"container_name":"test",.*$
                  image: eu.gcr.io/kyma-project/test-infra/bootstrap:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^.*"args":\["\/home\/prow\/go\/src\/github\.com\/kyma-project\/test-infra\/prow\/scripts\/cluster-integration\/kyma-integration-gardener-eventing-upgrade\.sh"\],"container_name":"test",.*$
                  image: eu.gcr.io/kyma-project/test-infra/kyma-integration:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^.*"args":\["\/home\/prow\/go\/src\/github\.com\/kyma-project\/test-infra\/prow\/scripts\/cluster-integration\/kyma-upgrade-gardener-kyma2-to-main\.sh"\],"container_name":"test",.*$
                  image: eu.gcr.io/kyma-project/test-infra/kyma-integration:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^.*"args":\["\/home\/prow\/go\/src\/github\.com\/kyma-project\/test-infra\/prow\/scripts\/cluster-integration\/kyma-upgrade-gardener-kyma2-minor-versions\.sh"\],"container_name":"test",.*$
                  image: eu.gcr.io/kyma-project/test-infra/kyma-integration:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^.*"args":\["\/home\/prow\/go\/src\/github\.com\/kyma-project\/test-infra\/prow\/scripts\/github-issues\.sh"\],"container_name":"test",.*$
                  image: europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^.*"args":\["\/home\/prow\/go\/src\/github\.com\/kyma-project\/test-infra\/prow\/scripts\/pr-image-guard\.sh"\],"container_name":"test",.*$
                  image: eu.gcr.io/kyma-project/test-infra/bootstrap:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^.*"args":\["\/home\/prow\/go\/src\/github\.com\/kyma-project\/test-infra\/prow\/scripts\/cluster-integration\/skr-aws-upgrade-integration-dev\.sh"\],"container_name":"test",.*$
                  image: eu.gcr.io/kyma-project/test-infra/kyma-integration:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^.*"args":\["\.\/scripts\/release.sh","ci"\],"container_name":"test",.*$
                  image: eu.gcr.io/kyma-project/test-infra/buildpack-golang:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^.*"args":\["make","release"\],"container_name":"test",.*$
                  image: eu.gcr.io/kyma-project/test-infra/buildpack-golang:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^.*"args":\["branchprotector","--config-path=prow\/config\.yaml","--job-config-path=prow\/jobs","--github-token-path=\/etc\/github\/token","--confirm","--github-endpoint=http:\/\/ghproxy","--github-endpoint=https:\/\/api\.github\.com"\],"container_name":"test",.*$
                  image: gcr.io/k8s-prow/branchprotector:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^.*"args":\["\/ghcomment\/github-comment","hide","--org","\$(REPO_OWNER)","--repo","\$(REPO_NAME)","-pr","\$(PULL_NUMBER)","-sha1","\$(PULL_PULL_SHA)"\],"container_name":"test",.*$
                  image: europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^.*"args":\["usersmapchecker"\],"container_name":"test",.*$
                  image: europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^.*"args":\["\/bin\/sh","-c","\/bin\/terraform\n-chdir=\.\/configs\/terraform\/secrets-leaks-log-scanner
                    init -input=false \\u0026\\u0026\n\/tfcmt\/tfcmt -owner \$REPO_OWNER -repo
                    \$REPO_NAME -pr \$PULL_NUMBER -sha \$PULL_PULL_SHA\nplan -- terraform -chdir=\.\/configs\/terraform\/secrets-leaks-log-scanner
                    plan\n-input=false; \/ghcomment\/github-comment hide --org \$(REPO_OWNER)
                    --repo \$(REPO_NAME) -pr \$(PULL_NUMBER) -sha1 \$(PULL_PULL_SHA)"\],"container_name":"test",.*$
                  image: europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^.*"args":\["\/bin\/sh","-c","\/bin\/terraform\n-chdir=\.\/configs\/terraform\/secrets-leaks-log-scanner
                    init -input=false \\u0026\\u0026\n\/tfcmt\/tfcmt -owner \$REPO_OWNER -repo
                    \$REPO_NAME -sha \$PULL_BASE_SHA apply\n-- terraform -chdir=\.\/configs\/terraform\/secrets-leaks-log-scanner
                    apply -input=false\n-auto-approve; \/ghcomment\/github-comment hide --org
                    \$(REPO_OWNER) --repo \$(REPO_NAME) -pr \$(PULL_NUMBER) -sha1 \$(PULL_PULL_SHA)"\],"container_name":"test",.*$
                  image: europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^.*"args":\["\/bin\/sh","-c","\/bin\/terraform\n-chdir=\.\/development\/secrets-rotator\/terraform\/environments\/prod
                    init -input=false\n\\u0026\\u0026 \/tfcmt\/tfcmt -owner \$REPO_OWNER -repo
                    \$REPO_NAME -pr \$PULL_NUMBER\n-sha \$PULL_PULL_SHA plan -- terraform -chdir=\.\/development\/secrets-rotator\/terraform\/environments\/prod\nplan
                    -input=false -var-file=\.\/terraform\.tfvars; \/ghcomment\/github-comment
                    hide --org \$(REPO_OWNER) --repo \$(REPO_NAME) -pr \$(PULL_NUMBER) -sha1 \$(PULL_PULL_SHA)"\],"container_name":"test",.*$
                  image: europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^.*"args":\["\/bin\/sh","-c","\/bin\/terraform\n-chdir=\.\/configs\/terraform\/environments\/prod
                    init -input=false \\u0026\\u0026\n\/tfcmt\/tfcmt -owner \$REPO_OWNER -repo
                    \$REPO_NAME -sha \$PULL_BASE_SHA apply\n-- terraform -chdir=\.\/configs\/terraform\/environments\/prod
                    apply -input=false\n-auto-approve  -var-file=\.\/terraform\.tfvars; \/ghcomment\/github-comment
                    hide --org \$(REPO_OWNER) --repo \$(REPO_NAME) -pr \$(PULL_NUMBER) -sha1 \$(PULL_PULL_SHA)"\],"container_name":"test",.*$
                  image: europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^.*"args":\["\/bin\/sh","-c","\/bin\/terraform\n-chdir=\.\/configs\/terraform\/environments\/prod
                    init -input=false \\u0026\\u0026\n\/tfcmt\/tfcmt -owner \$REPO_OWNER -repo
                    \$REPO_NAME -pr \$PULL_NUMBER -sha \$PULL_PULL_SHA\nplan -- terraform -chdir=\.\/configs\/terraform\/environments\/prod
                    plan -input=false\n-no-color; \/ghcomment\/github-comment hide --org \$(REPO_OWNER)
                    --repo \$(REPO_NAME) -pr \$(PULL_NUMBER) -sha1 \$(PULL_PULL_SHA)"\],"container_name":"test",.*$
                  image: europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*
                - args: []
                  command:
                  - /tools/entrypoint
                  entrypoint_options: ^.*"args":\["\/bin\/sh","-c","\/bin\/terraform\n-chdir=\.\/configs\/terraform\/environments\/prod
                    init -input=false \\u0026\\u0026\n\/tfcmt\/tfcmt -owner \$REPO_OWNER -repo
                    \$REPO_NAME -sha \$PULL_BASE_SHA apply\n-- terraform -chdir=\.\/configs\/terraform\/environments\/prod
                    apply -input=false\n-no-color -auto-approve; \/ghcomment\/github-comment hide
                    --org \$(REPO_OWNER) --repo \$(REPO_NAME) -pr \$(PULL_NUMBER) -sha1 \$(PULL_PULL_SHA)"\],"container_name":"test",.*$
                  image: europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*
                - args: []
                  command: []
                  image: gcr.io/k8s-prow/sidecar:*
        EOT -> null
      - yaml_incluster          = (sensitive value)
    }

Plan: 4 to add, 0 to change, 2 to destroy.
```

</details>





## :warning: Warnings :warning:

```hcl
Warning: "default_secret_name" is no longer applicable for Kubernetes v1.24.0 and above

  with kubernetes_service_account.trusted_workload_terraform_executor,
  on terraform-executor.tf line 42, in resource "kubernetes_service_account" "trusted_workload_terraform_executor":
  42: resource "kubernetes_service_account" "trusted_workload_terraform_executor" {

Starting from version 1.24.0 Kubernetes does not automatically generate a
token for service accounts, in this case, "default_secret_name" will be empty

(and one more similar warning elsewhere)

```






<!-- github-comment: {"Command":"plan","PRNumber":8045,"Program":"tfcmt","SHA1":"28e2e06442039e5be31740f7177c4702085dda3b","Vars":{}} -->